#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_vpc.main: Refreshing state... [id=vpc-0eed1e9e15fa5821b]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0e9d78aec6373d41e]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0e830c84519808d71]
aws_security_group.allow_http: Refreshing state... [id=sg-071b25945e6b8aa73]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-0fa5284b069bad171]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0d9d9b446889b0103]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0e0e5a751916d79f1]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0ba19825895090f8d]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0e0aab8ab4ae242c0]
aws_security_group.elb: Refreshing state... [id=sg-02c2809487dbae76e]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20221230170912211400000001]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0ce259ec6731988fd]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-067fd41d55d17689d]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0868fdce23db4d9f2]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-05ffaaf8fc9c4e467]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0c2d817187235fd9d]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0e209833059a5f3dc]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0a26b85ae9986e884]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20221230171022610100000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment must be replaced
-/+ resource "aws_autoscaling_attachment" "asg_attachment" {
      ~ autoscaling_group_name = "Auto Scaling Group" -> (known after apply) # forces replacement
      ~ id                     = "Auto Scaling Group-20221230171022610100000002" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_autoscaling_group.auto_scaling_group must be replaced
-/+ resource "aws_autoscaling_group" "auto_scaling_group" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:751012142648:autoScalingGroup:6837709d-a17d-49f8-9833-e9cac7601254:autoScalingGroupName/Auto Scaling Group" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - default_instance_warmup   = 0 -> null
      - enabled_metrics           = [] -> null
      ~ id                        = "Auto Scaling Group" -> (known after apply)
      - load_balancers            = [
          - "ELB",
        ] -> null
      - max_instance_lifetime     = 0 -> null
      ~ name                      = "Auto Scaling Group" -> "ASG" # forces replacement
      + name_prefix               = (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::751012142648:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*